In [ ]:
Q1. List any five functions of the pandas library with execution.

answer:
read_csv(): This function is used to read data from a CSV file into a DataFrame.
python
Copy code
import pandas as pd

# Read data from a CSV file
df = pd.read_csv('data.csv')

# Display the first few rows of the DataFrame
print(df.head())
info(): This function provides a concise summary of the DataFrame, including the data types of each column and the number of non-null values.
python
Copy code
# Display information about the DataFrame
print(df.info())
describe(): This function computes summary statistics for numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, and maximum values.
python
Copy code
# Display summary statistics for numerical columns
print(df.describe())
groupby(): This function is used to group data in the DataFrame based on specified criteria. It is often followed by an aggregation function (e.g., sum(), mean()) to compute summary statistics for each group.
python
Copy code
# Group data by 'Category' and calculate the mean of 'Value' for each group
grouped_data = df.groupby('Category')['Value'].mean()

# Display the result
print(grouped_data)
dropna(): This function is used to remove rows or columns from the DataFrame that contain missing values (NaN).
python
Copy code
# Drop rows with missing values
clean_df = df.dropna()

# Display the first few rows of the cleaned DataFrame
print(clean_df.head())

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [1]:
import pandas as pd

def reindex_dataframe(df):
    # Reset the index of the DataFrame
    df = df.reset_index(drop=True)
    
    # Create a new index starting from 1 and incrementing by 2 for each row
    new_index = pd.Index(range(1, len(df)*2, 2))
    
    # Assign the new index to the DataFrame
    df.index = new_index
    
    return df

# Example DataFrame
data = {'A': [10, 20, 30],
        'B': [40, 50, 60],
        'C': [70, 80, 90]}
df = pd.DataFrame(data)

# Reindex the DataFrame
df = reindex_dataframe(df)

# Print the DataFrame with the new index
print(df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

In [2]:
import pandas as pd

In [3]:
data11 = {"values":[2,4,6,4,8,9,32]}

In [6]:
df=pd.DataFrame(data11)

In [7]:
df

   values
0       2
1       4
2       6
3       4
4       8
5       9
6      32

In [20]:
sum_of_first_three_values = df['values'].iloc[:3].sum()

In [21]:
print("sum of first three values is :",sum_of_first_three_values)

sum of first three values is : 12

In [22]:
def test1(df):
    sum_of_first_three_values = df['values'].iloc[:3].sum()
    print("sum of first three values is :",sum_of_first_three_values)

In [23]:
test1(df)

sum of first three values is : 12

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [24]:
import pandas as pd

In [43]:
data2={"Text":["sudha nshu","ku mar","data science","hyun dai"]}
df1=pd.DataFrame(data2)

In [44]:
df1

           Text
0    sudha nshu
1        ku mar
2  data science
3      hyun dai

In [45]:

def count_words(text):
    word_count = len(text.split())
    return word_count

def add_word_count_column(df):
    df['Word_Count'] = df['Text'].apply(count_words)

In [46]:
add_word_count_column(df1)

In [47]:
df1

           Text  Word_Count
0    sudha nshu           2
1        ku mar           2
2  data science           2
3      hyun dai           2

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

answer:

DataFrame.size and DataFrame.shape are both attributes of a Pandas DataFrame, but they provide different information about the DataFrame:

DataFrame.size: This attribute returns the total number of elements in the DataFrame. It is equivalent to the number of rows multiplied by the 
number of columns.

DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame. It provides the number of rows and columns in the
DataFrame.

Here's a breakdown of the differences:

DataFrame.size:

Returns the total number of elements (cells) in the DataFrame.
Formula: Number of rows Ã— Number of columns.
It gives the total count of cells in the DataFrame.
The value of DataFrame.size is an integer.
DataFrame.shape:

Returns a tuple (number of rows, number of columns) representing the dimensions of the DataFrame.
It gives the number of rows and columns in the DataFrame.
The value of DataFrame.shape is a tuple containing two integers.

In [48]:
import pandas as pd

# Example DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

print("DataFrame.size:", df.size) 

# Using DataFrame.shape
print("DataFrame.shape:", df.shape)

DataFrame.size: 6
DataFrame.shape: (3, 2)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

answer:
pd.read_excel()
pd.read_excel() is a function provided by Pandas to read data from an Excel file.
You need to specify the file path (relative or absolute) as an argument to pd.read_excel(). Replace 'your_file.xlsx' with the path to your Excel file.

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [49]:
import pandas as pd

In [50]:
data3={"Email":["sudhanshu145@gmail.com","kumar435@gmail.com","rockstar398@gmail.com","mouli674@gmail.com"]}

In [51]:
df3=pd.DataFrame(data3)

In [64]:
df3

                    Email
0  sudhanshu145@gmail.com
1      kumar435@gmail.com
2   rockstar398@gmail.com
3      mouli674@gmail.com

In [68]:
def name_splitt(email):
    username = email.split('@')[0]
    return username
def add_column1(df):
    df3['username']=df3['Email'].apply(name_splitt)

In [69]:
add_column1(df3)

In [70]:
df3

                    Email      username
0  sudhanshu145@gmail.com  sudhanshu145
1      kumar435@gmail.com      kumar435
2   rockstar398@gmail.com   rockstar398
3      mouli674@gmail.com      mouli674

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [72]:
import pandas as pd

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

# Example DataFrame
data = {'A': [4, 6, 7, 8, 9],
        'B': [5, 3, 8, 9, 2],
        'C': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

selected_df = select_rows(df)

print(selected_df)

   A  B   C
1  6  3  20
2  7  8  30
3  8  9  40
4  9  2  50

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [73]:
import pandas as pd

In [74]:
data5={"Values":[3,4,5,87,54,335,7544,7,3,344.6736]}
df5=pd.DataFrame(data5)

In [75]:
df5

      Values
0     3.0000
1     4.0000
2     5.0000
3    87.0000
4    54.0000
5   335.0000
6  7544.0000
7     7.0000
8     3.0000
9   344.6736

In [84]:
def description(df):
    descrip=df['Values'].describe()
    return descrip

In [88]:
description(df5)

count      10.000000
mean      838.667360
std      2359.847558
min         3.000000
25%         4.250000
50%        30.500000
75%       273.000000
max      7544.000000
Name: Values, dtype: float64

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [89]:
import pandas as pd

In [104]:
data6={"sales":[64783,98467,76383,92345,43526,53652,87352,45698,98645,65432,95625],
       "date":[23,24,25,26,27,28,29,30,1,2,3]}

In [105]:
df=pd.DataFrame(data6)

In [106]:
df

    sales  date
0   64783    23
1   98467    24
2   76383    25
3   92345    26
4   43526    27
5   53652    28
6   87352    29
7   45698    30
8   98645     1
9   65432     2
10  95625     3

In [108]:
df['Moving_Average'] = df['sales'].rolling(window=7).mean()

In [109]:
df

    sales  date  Moving_Average
0   64783    23             NaN
1   98467    24             NaN
2   76383    25             NaN
3   92345    26             NaN
4   43526    27             NaN
5   53652    28             NaN
6   87352    29    73786.857143
7   45698    30    71060.428571
8   98645     1    71085.857143
9   65432     2    69521.428571
10  95625     3    69990.000000

In [116]:
import pandas as pd

def get_weekday_name(date_str):
    # Convert the date string to a datetime object and extract the weekday name
    return pd.Timestamp(date_str).day_name()

def add_weekday_column(df):
    # Add a new column 'Weekday' containing the weekday name
    df['Weekday'] = df['Date'].apply(get_weekday_name)

# Example DataFrame
data = {'Date': ['2024-03-18', '2024-03-19', '2024-03-20']}
df = pd.DataFrame(data)

# Add the 'Weekday' column
add_weekday_column(df)

# Print the DataFrame
print(df)

         Date    Weekday
0  2024-03-18     Monday
1  2024-03-19    Tuesday
2  2024-03-20  Wednesday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [117]:
import pandas as pd

def select_rows_within_date_range(df, start_date, end_date):
    # Convert the 'Date' column to datetime format if it's not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select rows within the date range
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return selected_rows

# Example DataFrame
data = {'Date': ['2023-01-01', '2023-01-15', '2023-02-01']}
df = pd.DataFrame(data)

# Specify the start and end dates for the date range
start_date = '2023-01-01'
end_date = '2023-01-31'

# Call the function to select rows within the date range
selected_df = select_rows_within_date_range(df, start_date, end_date)

# Print the selected DataFrame
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

answer:
To use the basic functions of Pandas, the first and foremost necessary library that needs to be imported is pandas itself.
import pandas as pd